package StageOne._面向对象;

/**
 * Writer:LiuXueKe
 * Time:2022/4/11、12:46
 * Java_Code
 * 什么是程序:
 *      程序是为了模拟现实世界 解决现实问题而使用计算机语言编写的指令集合
 * 现实世界的组成:
 *      世界是由什么组成的?
 *          有人说世界是由无数原子组成的
 *          有人说世界是由无数事物组成的
 *          有人说世界是由无数物体组成的
 *          有人说世界是由一切有生命的和一切没有生命的组成的
 *          有人说你、我、他、大家组成的
 *      在所有回答都很抽象 没有特别明确的答案
 *      在程序员眼里 世界的组成最为明确 世界是由无数个对象组成的
 *
 * 什么是对象:
 *      面向对象思想(Object Oriented Programming)
 *      一切客观存在的事物都是对象 万物皆对象
 *      任何对象一定具有自己的特征和行为
 *
 *              →→→→特征:称为属性 一般为名词 代表对象有什么
 *              ↑
 *      对象→→→→
 *              ↓
 *              →→→→行为:称为方法 一般为动词 代表对象能做什么
 *
 *      现实中的对象:
 *          例如手机:
 *          属性:
 *          品牌 颜色 价格 重量
 *          方法:
 *          接打电话 收发短信
 *
 *          例如汽车:
 *          属性:
 *          品牌 颜色 产地 型号
 *          方法:
 *          前进 后退 转向
 *
 *      程序中的对象:
 *      如何使用程序模拟现实世界 解决现实问题?
 *      首先 在程序当中 必须具有和显示中相同的对象 用以模拟现实世界
 *      然后 使用程序中的对象代表现实中的对象 并执行操作 进而解决现实问题
 *          如何在程序中创在出与现实中一样的对象?
 *                      →→→→→→→→→→→→→→→
 *          现实中的对象                 程序中的对象
 *                      ←←←←←←←←←←←←←←←
 *      现实中的对象多数来自于"模板" 程序中的对象也应该具有模板
 *
 * 什么是类:
 *      汽车设计图纸规定了该款汽车所有的组成部分 包括外观形状 内部结构 发动机型号 安全参数等具体信息 这即为现实对象的模板 程序中的模板也有相同作用 称之为"类"
 *
 *      按照设计图纸创造出来的汽车 才是真是存在 切实可用的实体 所以汽车实体被称为现实中的对象 而通过程序中的模板创在出来的实体 即为程序中的对象 称之为"对象"
 *
 * 类的抽取:
 *      在一组相同或类似的对象中 抽取出共性的特征和行为 保留所关注的部分
 */
public class 面向对象概述 {
    public static void main(String[] args) {
        System.out.println("以上所述");
    }
}
